In [38]:
import pandas as pd
import numpy as np

In [39]:
df = pd.read_csv('house_data.csv')

In [3]:
df.shape

(21607, 8)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21607 entries, 0 to 21606
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           99 non-null     float64
 1   date         99 non-null     object
 2   price        99 non-null     float64
 3   bedrooms     99 non-null     float64
 4   bathrooms    99 non-null     float64
 5   sqft_living  99 non-null     float64
 6   sqft_lot     99 non-null     float64
 7   floors       99 non-null     float64
dtypes: float64(7), object(1)
memory usage: 1.3+ MB

In [5]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
count,9.900000e+01,9.900000e+01,99.000000,99.000000,99.000000,99.000000,99.000000
mean,4.664620e+09,5.200763e+05,3.404040,1.989899,2086.383838,11478.818182,1.464646
std,2.935212e+09,3.061939e+05,0.794358,0.729236,864.592421,14655.249813,0.511363
min,1.600040e+07,1.530000e+05,2.000000,1.000000,770.000000,1044.000000,1.000000
25%,1.914950e+09,3.070000e+05,3.000000,1.500000,1410.000000,5000.000000,1.000000
50%,4.036801e+09,4.300000e+05,3.000000,2.000000,1900.000000,6720.000000,1.500000
75%,7.337325e+09,6.562500e+05,4.000000,2.500000,2570.000000,9823.000000,2.000000
max,9.822700e+09,2.000000e+06,5.000000,4.500000,5420.000000,101930.000000,3.000000

In [6]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0

In [7]:
df.tail()

       id date  price  bedrooms  bathrooms  sqft_living  sqft_lot  floors
21602 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21603 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21604 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21605 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21606 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN

In [8]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors'],
      dtype='object')

In [9]:
df['sqft_living'].max()

5420.0

In [10]:
df['sqft_living'].min()

770.0

In [11]:
df.price.isnull().sum()

21508

In [12]:
df['price'].replace(to_replace = np.nan, value = 0, inplace = True)

In [13]:
df.price.mean()

2382.9108622205767

In [14]:
df.price.count()

21607

In [40]:
df1 = df.dropna()

In [47]:
df1.price.mean()

520076.31313131313

In [48]:
df1.price.count()

99

In [41]:
df1.floors.unique()

array([1. , 2. , 1.5, 3. ])

In [42]:
df1.set_index('id', inplace=True)

In [43]:
df1

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
id,,,,,,,
7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0
...,...,...,...,...,...,...,...
6.021502e+09,20141223T000000,700000.0,3.0,1.50,1580.0,5000.0,1.0
1.483301e+09,20140908T000000,905000.0,4.0,2.50,3300.0,10250.0,1.0
3.422049e+09,20150330T000000,247500.0,3.0,1.75,1960.0,15681.0,1.0
1.099611e+09,20140912T000000,199000.0,4.0,1.50,1160.0,6400.0,1.0
7.220791e+08,20140711T000000,314000.0,3.0,1.75,1810.0,41800.0,1.0

In [44]:
df1[df1.price == df.price.max()]

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
id,,,,,,,
2.524049e+09,20140826T000000,2000000.0,3.0,2.75,3050.0,44867.0,1.0

In [45]:
df2 = df1.copy()

In [46]:
train = df2.sample(frac=0.75,random_state=1)
test = df2.drop(train.index)

In [35]:
train

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
id,,,,,,,
4.168000e+09,20150226T000000,153000.0,3.0,1.00,1200.0,10500.0,1.0
1.523059e+09,20150128T000000,356000.0,3.0,1.50,1680.0,8712.0,1.0
4.610004e+08,20140624T000000,687500.0,4.0,1.75,2330.0,5000.0,1.5
5.104520e+09,20141202T000000,390000.0,3.0,2.50,2350.0,5100.0,2.0
6.300000e+09,20140609T000000,410000.0,3.0,1.00,1410.0,5060.0,1.0
...,...,...,...,...,...,...,...
2.799801e+09,20150407T000000,301000.0,3.0,2.50,2420.0,4750.0,2.0
7.137970e+09,20140703T000000,285000.0,5.0,2.50,2270.0,6300.0,2.0
9.558200e+09,20140828T000000,289000.0,3.0,1.75,1260.0,8400.0,1.0
9.528103e+09,20141207T000000,549000.0,3.0,1.75,1540.0,1044.0,3.0
2.008000e+09,20150115T000000,291850.0,3.0,1.50,1060.0,9711.0,1.0

In [36]:
test.count()

date           25
price          25
bedrooms       25
bathrooms      25
sqft_living    25
sqft_lot       25
floors         25
dtype: int64